Белгипрозем_2017/src/Documents/РеестрТекущихПлатежей/РеестрТекущихПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрТекущихПлатежей</name>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>СуммаПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПлатежа</name>
    <type>
      <types>EnumRef.М_НаправлениеПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НашБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СметнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплатыЭтапаДоговора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЭтапа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПлатежа</name>
      <type>
        <types>CatalogRef.мСпособыПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДоговора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Enums/М_НаправлениеПлатежа/М_НаправлениеПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>М_НаправлениеПлатежа</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/мВидыДатДоговоров/мВидыДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мВидыДатДоговоров</name>
  <predefined>
    <items>
      <name>ДатаВозвратаДоговора</name>
      <description>Дата возврата договора</description>
    </items>
    <items>
      <name>ДатаВозобновленияРабот</name>
      <description>Дата возобновления работ</description>
    </items>
    <items>
      <name>ДатаВыполнения</name>
      <description>Дата выполнения</description>
    </items>
    <items>
      <name>ДатаЗакрытия</name>
      <description>Дата закрытия</description>
    </items>
    <items>
      <name>ДатаОплаты</name>
      <description>Дата оплаты</description>
    </items>
    <items>
      <name>ДатаПодписанияЗаказчиком</name>
      <description>Дата подписания заказчиком</description>
    </items>
    <items>
      <name>ДатаПредоставленияДокументов</name>
      <description>Дата предоставления документов</description>
    </items>
    <items>
      <name>ДатаПриостановленияРабот</name>
      <description>Дата приостановления работ</description>
    </items>
    <items>
      <name>ДатаПродления</name>
      <description>Дата продления</description>
    </items>
    <items>
      <name>ДатаРегистрации</name>
      <description>Дата регистрации</description>
    </items>
    <items>
      <name>ПлановыйСрок</name>
      <description>Плановый срок</description>
    </items>
  </predefined>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/РеестрТекущихПлатежей/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	              |	РеестрТекущихПлатежейЭтапы.Договор.Корреспондент КАК Корреспондент,
	              |	РеестрТекущихПлатежейЭтапы.Договор КАК Договор,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора КАК ЭтапДоговора,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	ВЫБОР
	              |		КОГДА РеестрТекущихПлатежейЭтапы.Ссылка.НаправлениеПлатежа = ЗНАЧЕНИЕ(Перечисление.М_НаправлениеПлатежа.Поступление)
	              |			ТОГДА РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора
	              |		ИНАЧЕ -РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора
	              |	КОНЕЦ КАК Сумма,
	              |	РеестрТекущихПлатежейЭтапы.НомерПлатежногоДокумента КАК НомерДокумента,
	              |	РеестрТекущихПлатежейЭтапы.ДатаПлатежногоДокумента КАК ДатаДокумента,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка.Дата КАК Период,
	              |	РеестрТекущихПлатежейЭтапы.СпособПлатежа КАК СпособПлатежа
	              |ИЗ
	              |	Документ.РеестрТекущихПлатежей.Этапы КАК РеестрТекущихПлатежейЭтапы
	              |ГДЕ
	              |	РеестрТекущихПлатежейЭтапы.Ссылка = &Ссылка
	              |	И РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора > 0
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЗНАЧЕНИЕ(Справочник.мВидыДатДоговоров.ДатаОплаты) КАК ВидДатыДоговора,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка КАК Ссылка,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка.Дата КАК Период,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка.Дата КАК Дата,
	              |	РеестрТекущихПлатежейЭтапы.Договор КАК Договор,
	              |	РеестрТекущихПлатежейЭтапы.Договор.ДатаРегистрации КАК ДатаРегистрации,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора КАК ЭтапДоговора,
                  //|	РеестрТекущихПлатежейЭтапы.Договор.Корреспондент КАК Корреспондент,
	              |	РеестрТекущихПлатежейЭтапы.НомерПлатежногоДокумента КАК Комментарий,
	              |	РеестрТекущихПлатежейЭтапы.Ссылка КАК Основание,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора.ДлительностьВыполненияРабот КАК Длительность,
	              |	РеестрТекущихПлатежейЭтапы.ЭтапДоговора.ВидДней КАК ВидДней
	              |ИЗ
	              |	Документ.РеестрТекущихПлатежей.Этапы КАК РеестрТекущихПлатежейЭтапы
	              |ГДЕ
	              |	РеестрТекущихПлатежейЭтапы.Ссылка = &Ссылка
	              |	И РеестрТекущихПлатежейЭтапы.СуммаОплатыЭтапаДоговора <> 0";
                  //| И РеестрТекущихПлатежейЭтапы.Ссылка.НаправлениеПлатежа = ЗНАЧЕНИЕ(Перечисление.М_НаправлениеПлатежа.Поступление)";

				  Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДатыДоговоров", Результат[1].Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
